# Brewfile — Mac dependencies
# Install everything with: brew bundle

# CLI tools
brew "git"
brew "mise"

# Kubernetes
brew "kubectl"
brew "derailed/k9s/k9s"
brew "kubectx"          # installs kubectx + kubens

# Cloud CLIs
brew "awscli"
brew "azure-cli"
cask "google-cloud-sdk"

# Containers
brew "podman"
dtop

# Zsh plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Terminal utilities
brew "fzf"
brew "ripgrep"
brew "jq"
brew "yq"
brew "tldr"

# Apps (GUI)
cask "alt-tab"
cask "brave-browser"
cask "claude-code"
cask "obsidian"
cask "visual-studio-code"
cask "slack"
cask "discord"
cask "clickup"
cask "bitwarden"
cask "rectangle"
cask "google-chrome"
